Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCutoutError Property
 Can't make cut-out.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCutoutError { get; }
Public Shared ReadOnly Property CannotCreateCutoutError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCutoutError {
	FailureDefinitionId^ get ();
}
static member CannotCreateCutoutError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace